# TextNote Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNote Class
Members See Also
---
A class representing text note annotations in Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class TextNote : TextElement
```

Visual Basic
---
```text
Public Class TextNote _
	Inherits TextElement
```

Visual C++
---
```text
public ref class TextNote : public TextElement
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..TextElement Autodesk.Revit.DB..::..TextNote
# See Also
TextNote Members
Autodesk.Revit.DB Namespace